FA18/MA300/direct.tex
% Created 2018-10-12 Fri 20:43
% Intended LaTeX compiler: pdflatex
\documentclass[11pt, oneside]{amsart}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{amsmath,amsthm,amsfonts,amssymb,amsxtra}
\pagestyle{empty}
\setlength{\textwidth}{7in}
\setlength{\oddsidemargin}{-0.5in}
\setlength{\topmargin}{-1.0in}
\setlength{\textheight}{9.5in}
\author{Francisco J. Blanco-Silva}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Francisco J. Blanco-Silva},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.0.50 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}


\section{Problems in Chapter 4}
\label{sec:orgbb03820}
\subsection{If \(x\) is an even integer, then \(x^2\) is even.}
\label{sec:org4eea571}
\begin{itemize}
\item \(x = 2a\)
\item \(x^2= 4a^2 = 2(2a^2)\)
\end{itemize}

\subsection{If \(x\) is odd, then \(x^3\) is odd.}
\label{sec:org6baf8c2}
\begin{itemize}
\item \(x=2a+1\)
\item \(x^3 = (2a+1)^3 = 8a^3 + 3*4a^2 + 3*2a + 1 = 2(4a^3+6a^2+3a)+1\)
\end{itemize}

\subsection{If \(a\) is odd, then \(a^2+3a+5\) is odd}
\label{sec:orgb363384}
\begin{itemize}
\item \(a=2b+1\)
\item \(a^2+3a+5 = (2b+1)^2 + 3(2b+1) + 5 = 4b^2+1+4b+6b+8 = 2(2b^2+5b+4)+1\)
\end{itemize}

\subsection{If \(x,y\) odd, then \(xy\) is odd.}
\label{sec:orgdd2148b}
\begin{itemize}
\item \(x=2a+1\)
\item \(y=2b+1\)
\item \(xy=(2a+1)(2b+1)=4ab+2a+2b+1 = 2(2ab+a+b)+1\)
\end{itemize}

\subsection{If \(x\) is even \(xy\) is even.}
\label{sec:org6511be8}
\begin{itemize}
\item \(x=2a\)
\item \(xy=2ay\)
\end{itemize}

\subsection{If \(a \mid b\) and \(a \mid c\), then \(a \mid (b+c)\).}
\label{sec:org8406dc1}
\begin{itemize}
\item \(b=ax\)
\item \(c=ay\)
\item \(b+c = ax+ay = a(x+y)\)
\end{itemize}

\subsection{If \(a \mid b\) then \(a^2 \mid b^2\).}
\label{sec:org9e8a217}
\begin{itemize}
\item \(b=ax\)
\item \(b^2 = a^2x^2\)
\end{itemize}

\subsection{If \(5 \mid 2a\) then \(5 \mid a\).}
\label{sec:orgc902dab}
\begin{itemize}
\item \(2a = 5x\)
\item Note that \(a, 2a\) and \(5x\) are integers
\item Also, \(a = 5x/2\), so \(5x/2\) is an integer.
\item This is only possible if \(x=2q\) for some \(q\).  We can then write \(a = 5q\).
\end{itemize}

\subsection{If \(7 \mid 4a\) then \(7 \mid a\)}
\label{sec:org3d5cd08}
\begin{itemize}
\item \(4a = 7x\)
\item Since \(a, 4a, 7x\) are integers, it must be \(a = 7x/4\) an integer too.
\item This is only possible if \(x = 4q\) for some integer \(q\).  We can then write \(a=7q\).
\end{itemize}

\subsection{If \(a \mid b\) then \(a \mid (3b^3-b^2+5b)\)}
\label{sec:org47f2b7c}
\begin{itemize}
\item \(b=ax\)
\item \(3b^2-b^2+5b = b(3b^2-b+5)=ax(3b^2-b+5)\)
\end{itemize}

\subsection{If \(a \mid b\) and \(c \mid d\), then \(ac \mid bd\)}
\label{sec:org8fd2af6}
\begin{itemize}
\item \(b=ax\)
\item \(d=cy\)
\item \(bd = (ax)(cy)=(ac)(xy)\)
\end{itemize}

\subsection{If \(x \in \mathbb{R}\) and \(0 < x < 4\), then \(\frac{4}{x(4-x)} \geq 1\).}
\label{sec:org47a5e18}

\begin{enumerate}
\item First attempt, try to find stuff about the function \(f(x) = \frac{4}{x(4-x)}\)
\label{sec:orgacdd75c}
\begin{itemize}
\item \(f(x) = \frac{4}{x(4-x)} = \frac{4}{4x-x^2} = 4(4x-x^2)^{-1}\)
\item \(f'(x) = -4(4x-x^2)^{-2}(4-2x) = -8\frac{2-x}{x^2(4-x)^2}\)
\item \(f'(x)=0\) at \(x=2\)
\item Between 0 and 2, the function is decreasing (\(f'(x)<0\).) It is increasing between 2 and 4.
\item The minimum is at \(x=2\). \(f(2)=1\).
\end{itemize}

\item Second attempt: Start from the bottom.
\label{sec:orgffbf44b}
\begin{center}
\begin{tabular}{|c|l|}
\hline
\(x>0\) & \\
\hline
\(4-x>0\) & \\
\hline
\(\vdots\) & \\
\hline
\(4 \geq x(4-x)\) & parabola \(x(4-x)\) has a max at \(x=2\)\\
\hline
\(\dfrac{4}{x(4-x)} \geq 1\) & cause both \(x>0\) and \(4-x>0\), inequality does not change\\
\hline
\end{tabular}
\end{center}

So this one gives me a better idea.  Start by considering the parabola \(y = f(x) = x(4-x)\).  Draw it, note that the
function is positive in the interval \(0<x<4\).  It also have a maximum at \(x=2\), and \(f(2) = 4\).
\end{enumerate}

\subsection{Suppose \(x, y \in \mathbb{R}\).  If \(x^2+5y = y^2+5x\), then \(x=y\) or \(x+y=5\).}
\label{sec:org10e76c5}
\begin{enumerate}
\item First attempt:
\label{sec:org1d91685}
\begin{itemize}
\item \(x^2+5y = y^2+5x\)
\item \(x^2-5x = y^2-5y\)
\item \(x(x-5) = y(y-5)\)
\item Careful now!  Think \(4 \cdot 6 = 2 \cdot 12\).
\item If \(x=0\), then \(y(y-5)=0\), which gives \(y=0\) or \(y=5\).  (in this case, \(y=0\) gives \(x=y\).  If \(y=5\), then note that \(x+y=5\))
\item But after that I am stuck\ldots{} Maybe the last expression is not so useful after all.  Let's try to combine the 5's instead
\end{itemize}
\item Second attempt:
\label{sec:orge18e8fb}
\begin{itemize}
\item \(x^2-y^2 = 5x-5y\)
\item \((x-y)(x+y)=5(x-y)\)
\item I like this one more. We could eliminate \(x-y\) from that equation, provided \(x-y \neq 0\).  In this case, we would have \(x+y=5\).
\item In case we cannot eliminate it, it is \(x-y=0\), which is precisely the condition \(x=y\).
\end{itemize}
\end{enumerate}

\subsection{If \(n \in \mathbb{Z}\), then \(5n^2+3n+7\) is odd.}
\label{sec:orgbf6787e}
\begin{itemize}
\item Case 1) \(n=2a\): \(5n^2+3n+7 = 5(2a)^2+6a+7=20a^2+6a+7 = 2(10a^2+3a+3)+1\)
\item Case 2) \(n=2a+1\): \(5n^2+3n+7 = 5(2a+1)^2+3(2a+1)+7 = 5(4a^2+1+4a)+6a+10 = 20a^2+26a+15 =2(10a^2+13a+7)+1\)
\end{itemize}

\subsection{If \(n \in \mathbb{Z}\), then \(n^2+3n+4\) is even.}
\label{sec:orgd0a4a05}
\begin{itemize}
\item Case 1) \(n=2a\): \(n^2+3n+4 = (2a)^2+3(2a)+4\) even
\item Case 2) \(n=2a+1\): \((2a+1)^2+3(2a+1)+4 = 4a^2+1+4a+6a+3+4 = 4a^2+10a+8\) even
\end{itemize}

\subsection{If two integers have the same parity, then their sum is even}
\label{sec:orgdb671b0}
\begin{itemize}
\item Case 1) \(n=2a, m=2b\): \(n+m = 2a+2b\) even
\item Case 2) \(n=2a+1, m=2b+1\): \(n+m = 2a+1+2b+1 = 2(a+b)+2\)
\end{itemize}

\subsection{If two integers have opposite parity, then their product is even}
\label{sec:org7767278}
\begin{itemize}
\item WLOG \(n=2a, m=2b+1\)
\item \(n \cdot m = 2a(2b+1) = 4ab+2a\) even
\end{itemize}

\subsection{Suppose \(x\) and \(y\) are positive real numbers.  If \(x<y\), then \(x^2<y^2\)}
\label{sec:org9239d5c}
\begin{itemize}
\item This one is cool to start from the bottom
\item \(x>0\) and \(y>0 \implies x+y>0\)
\item \(x<y \implies x-y<0\)
\item \((x-y)(x+y)<0\)
\item \(x^2-y^2<0\)
\item \(x^2<y^2\)
\end{itemize}

\subsection{Suppose \(a, b, c\) are integers.  If \(a^2 \mid b\) and \(b^3 \mid c\), then \(a^6 \mid c\).}
\label{sec:orgf7e5712}
\begin{itemize}
\item \(a^2 \mid b \implies b = a^2 x\)
\item \(b^3 \mid c \implies c = b^3 y\)
\item \(c = b^3 y = (a^2 x)^3 y = a^6 x^3 y\)
\end{itemize}

\subsection{If \(a\) is an integer and \(a^2 \mid a\), then \(a \in \{-1, 0 , 1\}\)}
\label{sec:orgc4cfd3a}
\begin{itemize}
\item \(a^2 \mid a \implies a = a^2 x\)  (\(x\) integer!)
\item If \(a \neq 0\), we can divide both sides to get \(1/a = x\) is an integer.  It can only be \(a=-1\) or \(a=1\)
\item \(a=0\) is the other option.
\end{itemize}

\subsection{{\bfseries\sffamily TODO} If \(p\) is prime and \(k\) is an integer for which \(0<k<p\), then \(p \mid {p \choose k}\)}
\label{sec:org4c1fffb}
\begin{itemize}
\item \(p\) is prime
\item \(0<k<p\)
\item \({p \choose k} = \frac{p!}{k!(p-k)!}\) is an integer.
\end{itemize}

\subsection{If \(n \in \mathbb{N}\), then \(n^2 = 2{n \choose 2}+ {n \choose 1}\).}
\label{sec:org281d180}
\begin{itemize}
\item This only makes sense for \(n \geq 2\) in my book.
\item \(2{n \choose 2} + {n \choose 1} = \frac{2n!}{2(n-2)!} + n = n(n-1)+n = n^2-n+n\)
\end{itemize}

\subsection{{\bfseries\sffamily TODO} If \(n \in \mathbb{N}\), then \({2n \choose n}\) is even}
\label{sec:org1489c03}

\begin{align*}
{2n \choose n} &= \frac{(2n)!}{n!n!} \\ &= \frac{2n \cdot (2n-1) \cdot (2n-2) \dotsb  (n+1)}{ n! } \\ 
&= \frac{2n (2n-2) (2n-4) \dotsb (2n-(2n+2)) \cdot \text{stuff}}{n!} 
\end{align*}


\subsection{{\bfseries\sffamily TODO} If \(n \in \mathbb{N}\) and \(n \geq 2\), then the numbers \(n!+2, n!+3, \dotsc, n!+n\) are all composite.}
\label{sec:orgb42add0}

\subsection{{\bfseries\sffamily TODO} If \(a,b,c \in \mathbb{N}\) and \(c \leq b \leq a\), then \({a \choose b} {b \choose c} = {a \choose b-c} {a-b+c \choose c}\).}
\label{sec:org01da224}

\subsection{{\bfseries\sffamily DONE} Every odd integer is a difference of two squares.}
\label{sec:orgbc911b8}
\begin{itemize}
\item \(n = 2a+1\)
\item \(\vdots\)
\item \(n = x^2 - y^2\)
\item Can we use somehow that \((a-b)(a-b)=a^2-b^2\)?
\item \(2x+1 = (a-b)(a+b)\)
\item This should have an easy solution (do the system) to get \(2a = n + 1\), or \(a=(n+1)/2\), and thus \(b=(n-1)/2\).
\end{itemize}
\begin{center}
\begin{tabular}{|c|c|c|c|c|c|}
\hline
\(n\) & \(2n-1\) & \(a^2-b^2\) & \((a-b)(a+b)\) & \(a+b\) & \(a-b\)\\
\hline
1 & 1 & \(1^2 - 0^2\) &  & 1 & 1\\
2 & 3 & \(2^2 - 1^2\) & \((2-1)(2+1)\) & 3 & 1\\
3 & 5 & \(3^2 - 2^2\) & \((3-2)(3+2)\) & 5 & 1\\
4 & 7 & \(4^2 - 3^2\) & \((4-3)(4+3)\) & 7 & 1\\
5 & 9 & \(5^2 - 4^2\) & \((5-4)(5+4)\) & 9 & 1\\
6 & 11 & \(6^2 - 5^2\) & \((6-5)(6+5)\) & 11 & 1\\
7 & 13 & \(7^2 - 6^2\) & \((7-6)(7+6)\) & 13 & 1\\
\hline
\end{tabular}
\end{center}

\subsection{{\bfseries\sffamily DONE} Suppose \(a, b \in \mathbb{N}\) If \(\gcd(a,b)>1\), then \(b \mid a\) or \(b\) is not prime.}
\label{sec:org4c526c3}
\begin{itemize}
\item \(\gcd(a,b) \neq 1\) suggests that \(a\) and \(b\) have at least one common divisor.
\item If \(b\) is not prime, then there is nothing to prove (it is one of the conclusions!)
\item If \(b\) is prime, then the only possible divisor for both \(a\) and \(b\) has to be precisely \(b\).
\end{itemize}

\subsection{If \(a, b, c \in \mathbb{N}\), then \(c \gcd(a,b) \leq gcd(ca, cb)\)}
\label{sec:org4f9dafe}
\begin{itemize}
\item \(\gcd(a,b)\) is the largest divisor of both \(a\) and \(b\).
\item In particular, \(\gcd(a,b)\) is \textbf{a} divisor of both \(a\) and \(b\)
\item In this case, \(c \cdot \gcd(a,b)\) is a divisor of both \(ca\) and \(cb\).
\item \(c \cdot \gcd(a,b) \leq gcd(ca, cb)\) because \(gcd(ca, cb)\) is \textbf{the} largest divisor of both \(ca\) and \(cb\).
\end{itemize}
\end{document}